"""Напишите лямбда-функцию, которая принимает два числа и возвращает их сумму. Затем используйте эту функцию для сложения чисел 7 и 1"""

group_1 = lambda x, y: x + y
print(sum(7, 13))
