"""Дан список чисел: [1, 2, 3, 4, 5]. Используя функцию map, возведите каждое число в квадрат и выведите результат"""

numbers = [1, 2, 3, 4, 5]
print(list(map(lambda x: x**2, numbers)))
343
